<p style="font-family: Arial; font-size:3.75em;color:purple; font-style:bold"><br>
Pandas</p><br>

*pandas* is a Python library for data analysis. It offers a number of data exploration, cleaning and transformation operations that are critical in working with data in Python. 

*pandas* build upon *numpy* and *scipy* providing easy-to-use data structures and data manipulation functions with integrated indexing.

The main data structures *pandas* provides are *Series* and *DataFrames*. After a brief introduction to these two data structures and data ingestion, the key features of *pandas* this notebook covers are:
* Generating descriptive statistics on data
* Data cleaning using built in pandas functions
* Frequent data operations for subsetting, filtering, insertion, deletion and aggregation of data
* Merging multiple datasets using dataframes
* Working with timestamps and time-series data

**Additional Recommended Resources:**
* *pandas* Documentation: http://pandas.pydata.org/pandas-docs/stable/
* *Python for Data Analysis* by Wes McKinney
* *Python Data Science Handbook* by Jake VanderPlas

Let's get started with our first *pandas* notebook!

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold"><br>

Import Libraries
</p>

In [21]:
import pandas as pd

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Introduction to pandas Data Structures</p>
<br>
*pandas* has two main data structures it uses, namely, *Series* and *DataFrames*. 

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
pandas Series</p>

*pandas Series* one-dimensional labeled array.

In [6]:
ser = pd.Series(data=[80, 78, 89, 93, 80], index=['tom', 'bob', 'nancy', 'dan', 'eric'])

In [5]:
ser

tom      80
bob      78
nancy    89
dan      93
eric     80
dtype: int64

In [7]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [11]:
ser['nancy']

np.int64(89)

In [13]:
ser[[4, 3, 1]]

/var/folders/bh/3yn_1rsd3fn2j2cnydsmxnz40000gn/T/ipykernel_5512/707641178.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[[4, 3, 1]]

eric    80
dan     93
bob     78
dtype: int64

In [14]:
'bob' in ser

True

In [15]:
ser

tom      80
bob      78
nancy    89
dan      93
eric     80
dtype: int64

In [16]:
ser * 2

tom      160
bob      156
nancy    178
dan      186
eric     160
dtype: int64

In [17]:
ser ** 2

tom      6400
bob      6084
nancy    7921
dan      8649
eric     6400
dtype: int64

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
pandas DataFrame</p>

*pandas DataFrame* is a 2-dimensional labeled data structure.

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Create DataFrame from dictionary of Python Series</p>

In [25]:
d = {'Math' : pd.Series([95., 90., 91.], index=['Sok', 'Tom', 'Makara']),
     'Physics' : pd.Series([80., 86., 78., 60.], index=['Sok', 'Tom', 'Rachna', 'Meas'])}

In [26]:
df = pd.DataFrame(d)
print(df)

        Math  Physics
Makara  91.0      NaN
Meas     NaN     60.0
Rachna   NaN     78.0
Sok     95.0     80.0
Tom     90.0     86.0

In [27]:
df.index

Index(['Makara', 'Meas', 'Rachna', 'Sok', 'Tom'], dtype='object')

In [28]:
df.columns

Index(['Math', 'Physics'], dtype='object')

In [29]:
pd.DataFrame(d, index=['Sok', 'Tom', 'Rachna'])

        Math  Physics
Sok     95.0     80.0
Tom     90.0     86.0
Rachna   NaN     78.0

In [30]:
pd.DataFrame(d, index=['Rachna', 'Tom', 'Makara'], columns=['Math', 'Physics'])

        Math  Physics
Rachna   NaN     78.0
Tom     90.0     86.0
Makara  91.0      NaN

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Create DataFrame from list of Python dictionaries</p>

In [31]:
data = [{'Math': 91, 'Physics': 92}, 
        {'Math': 89, 'Physics': 80},
        {'Math': 67, 'Physics': 76},
        {'Math': 96, 'Physics': 90},
        {'Math': 81, 'Physics': 88}]

In [32]:
pd.DataFrame(data)

   Math  Physics
0    91       92
1    89       80
2    67       76
3    96       90
4    81       88

In [33]:
pd.DataFrame(data, index=['Makara', 'Meas', 'Rachna', 'Sok', 'Tom'])

        Math  Physics
Makara    91       92
Meas      89       80
Rachna    67       76
Sok       96       90
Tom       81       88

In [34]:
pd.DataFrame(data, columns=['Math']) #columns input is a list type

   Math
0    91
1    89
2    67
3    96
4    81

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Basic DataFrame operations</p>

In [35]:
df = pd.DataFrame(data, index=['Makara', 'Meas', 'Rachna', 'Sok', 'Tom'])

In [169]:
df['Math']

Makara    91
Meas      89
Rachna    67
Sok       96
Tom       81
Name: Math, dtype: int64

In [52]:
df['Multiple'] = df['Math'] * df['Physics']
df

        Math  Physics   flag  Multiple
Makara    91       92   True      8372
Meas      89       80   True      7120
Rachna    67       76  False      5092
Sok       96       90   True      8640
Tom       81       88   True      7128

In [39]:
df['flag'] = df['Math'] > 80
df

        Math  Physics  Multiple   flag
Makara    91       92      8372   True
Meas      89       80      7120   True
Rachna    67       76      5092  False
Sok       96       90      8640   True
Tom       81       88      7128   True

In [50]:
df[df['Math'] > 90]['Math']

Makara    91
Sok       96
Name: Math, dtype: int64

In [53]:
Multiple_del = df.pop('Multiple') #still be able to access the deleted column with variable Multiple_del

In [41]:
Multiple_del

Makara    8372
Meas      7120
Rachna    5092
Sok       8640
Tom       7128
Name: Multiple, dtype: int64

In [54]:
df

        Math  Physics   flag
Makara    91       92   True
Meas      89       80   True
Rachna    67       76  False
Sok       96       90   True
Tom       81       88   True

In [179]:
del df['copy_of_Physics']

In [180]:
df

        Math  Physics
Makara    91       92
Meas      89       80
Rachna    67       76
Sok       96       90
Tom       81       88

In [181]:
#df['another_copy_Math'] = df['Math']
#df.insert(2, 'copy_of_Math', df['Math'])
df.insert(1, 'copy_of_Physics', df['Physics'])
df

        Math  copy_of_Physics  Physics
Makara    91               92       92
Meas      89               80       80
Rachna    67               76       76
Sok       96               90       90
Tom       81               88       88

In [31]:
df['one_upper_half'] = df['one'][:2]
df

          one   flag  copy_of_one  one_upper_half
apple   100.0  False        100.0           100.0
ball    200.0  False        200.0           200.0
cerill    NaN  False          NaN             NaN
clock   300.0   True        300.0             NaN
dancy     NaN  False          NaN             NaN

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Case Study: Movie Data Analysis</p>
<br>This notebook uses a dataset from the MovieLens website. We will describe the dataset further as we explore with it using *pandas*. 

## Download the Dataset

### Please note that **you will need to download the dataset**. 

Although the video for this notebook says that the data is in your folder, the folder turned out to be too large to fit on the edX platform due to size constraints.

Here are the links to the data source and location:
* **Data Source:** MovieLens web site (filename: ml-25m.zip)
* **Location:** https://grouplens.org/datasets/movielens/

Once the download completes, please make sure the data files are in a directory called **movielens** folder. 

Let us look at the files in this dataset using the UNIX command ls.

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Use Pandas to Read the Dataset<br>
</p>
<br>
In this notebook, we will be using three CSV files:
* **ratings.csv :** *userId*,*movieId*,*rating*, *timestamp*
* **tags.csv :** *userId*,*movieId*, *tag*, *timestamp*
* **movies.csv :** *movieId*, *title*, *genres* <br>

Using the *read_csv* function in pandas, we will ingest these three files.

In [7]:
import pandas as pd

movies = pd.read_csv('./movielens/movies.csv', sep=',')
print(type(movies))
movies.head(10)
movies.tail(10)

<class 'pandas.core.frame.DataFrame'>

       movieId                           title                  genres
62413   209145                  Liberté (2019)                   Drama
62414   209147     The Carpet of Horror (1962)            Crime|Horror
62415   209151          Mao Zedong 1949 (2019)      (no genres listed)
62416   209153             Happy Flight (2008)            Comedy|Drama
62417   209155      Santosh Subramaniam (2008)   Action|Comedy|Romance
62418   209157                       We (2018)                   Drama
62419   209159       Window of the Soul (2001)             Documentary
62420   209163                Bad Poems (2018)            Comedy|Drama
62421   209169             A Girl Thing (2001)      (no genres listed)
62422   209171  Women of Devil's Island (1962)  Action|Adventure|Drama

In [8]:
# Timestamps represent seconds since midnight Coordinated Universal Time (UTC) of January 1, 1970

tags = pd.read_csv('./movielens/tags.csv', sep=',')
tags.head()

   userId  movieId               tag   timestamp
0       3      260           classic  1439472355
1       3      260            sci-fi  1439472256
2       4     1732       dark comedy  1573943598
3       4     1732    great dialogue  1573943604
4       4     7569  so bad it's good  1573943455

In [2]:
ratings = pd.read_csv('./movielens/ratings.csv', sep=',', parse_dates=['timestamp'])
ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [35]:
# For current analysis, we will remove timestamp (we will come back to it!)

del ratings['timestamp']
del tags['timestamp']

<h1 style="font-size:2em;color:#2467C0">Data Structures </h1>

<h1 style="font-size:1.5em;color:#2467C0">Series</h1>

In [183]:
#Extract 0th row: notice that it is infact a Series

row_0 = tags.iloc[0]
type(row_0)

pandas.core.series.Series

In [184]:
print(row_0)

userId                           3
movieId                        260
tag                        classic
timestamp               1439472355
parsed_time    2015-08-13 13:25:55
Name: 0, dtype: object

In [185]:
row_0.index

Index(['userId', 'movieId', 'tag', 'timestamp', 'parsed_time'], dtype='object')

In [186]:
row_0['userId']

3

In [187]:
'rating' in row_0

False

In [188]:
row_0.name

0

In [189]:
row_0 = row_0.rename('first_row')
row_0.name

'first_row'

<h1 style="font-size:1.5em;color:#2467C0">DataFrames </h1>

In [43]:
tags.head()

   userId  movieId               tag
0       3      260           classic
1       3      260            sci-fi
2       4     1732       dark comedy
3       4     1732    great dialogue
4       4     7569  so bad it's good

In [44]:
tags.index

RangeIndex(start=0, stop=1093360, step=1)

In [45]:
tags.columns

Index(['userId', 'movieId', 'tag'], dtype='object')

In [193]:
# Extract row 0, 11, 2000 from DataFrame

tags.iloc[[0,11,2000]]

tags.loc[[0,11,2000],['userId', 'tag', 'parsed_time']]

      userId           tag         parsed_time
0          3       classic 2015-08-13 13:25:55
11         4        cliche 2019-11-16 22:35:21
2000     647  twist ending 2017-09-16 22:07:04

<h1 style="font-size:2em;color:#2467C0">Descriptive Statistics</h1>

Let's look how the ratings are distributed!

In [47]:
ratings['rating'].describe()

count    2.500010e+07
mean     3.533854e+00
std      1.060744e+00
min      5.000000e-01
25%      3.000000e+00
50%      3.500000e+00
75%      4.000000e+00
max      5.000000e+00
Name: rating, dtype: float64

In [48]:
ratings['rating'].mean()

3.533854451353085

In [49]:
ratings.mean()

userId     81189.281154
movieId    21387.981943
rating         3.533854
dtype: float64

In [50]:
ratings['rating'].min()

0.5

In [51]:
ratings['rating'].max()

5.0

In [52]:
ratings['rating'].std()

1.0607439610179747

In [53]:
ratings['rating'].mode()

0    4.0
Name: rating, dtype: float64

In [54]:
ratings.corr()

           userId   movieId    rating
userId   1.000000 -0.004413  0.001940
movieId -0.004413  1.000000 -0.009216
rating   0.001940 -0.009216  1.000000

In [55]:
filter_1 = ratings['rating'] > 5
filter_1.any()

False

In [56]:
filter_2 = ratings['rating'] > 0
filter_2.all()

True

<h1 style="font-size:2em;color:#2467C0">Data Cleaning: Handling Missing Data</h1>

In [57]:
movies.shape

(62423, 3)

In [58]:
#is any row NULL ?

movies.isnull().any()

movieId    False
title      False
genres     False
dtype: bool

That's nice! No NULL values!

In [59]:
ratings.shape

(25000095, 3)

In [60]:
#is any row NULL ?

ratings.isnull().any()

userId     False
movieId    False
rating     False
dtype: bool

That's nice! No NULL values!

In [61]:
tags.shape

(1093360, 3)

In [62]:
#is any row NULL ?

tags.isnull().any()

userId     False
movieId    False
tag         True
dtype: bool

We have some tags which are NULL.

In [63]:
tags = tags.dropna()

In [64]:
#Check again: is any row NULL ?

tags.isnull().any()

userId     False
movieId    False
tag        False
dtype: bool

In [65]:
tags.shape

(1093344, 3)

That's nice! No NULL values! Notice the number of lines have decreased.

<h1 style="font-size:2em;color:#2467C0">Slicing Out Columns</h1>

In [68]:
tags['tag'].head()

0             classic
1              sci-fi
2         dark comedy
3      great dialogue
4    so bad it's good
Name: tag, dtype: object

In [69]:
movies[['title','genres']].head()

,title,genres
0,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,Jumanji (1995),Adventure|Children|Fantasy
2,Grumpier Old Men (1995),Comedy|Romance
3,Waiting to Exhale (1995),Comedy|Drama|Romance
4,Father of the Bride Part II (1995),Comedy

In [70]:
ratings[1000:1010]

      userId  movieId  rating
1000       4    45517     2.5
1001       4    45722     3.5
1002       4    46948     2.5
1003       4    46972     3.5
1004       4    48780     5.0
1005       4    48982     3.0
1006       4    49272     3.5
1007       4    49396     3.5
1008       4    49649     1.0
1009       4    50601     1.5

In [71]:
tag_counts = tags['tag'].value_counts()
tag_counts[:10]

sci-fi                8330
atmospheric           6516
action                5907
comedy                5702
surreal               5326
based on a book       5079
twist ending          4820
funny                 4738
visually appealing    4526
dystopia              4257
Name: tag, dtype: int64

<h1 style="font-size:2em;color:#2467C0">Filters for Selecting Rows</h1>

In [194]:
is_highly_rated = ratings['rating'] >= 4.0

ratings[is_highly_rated][-5:]

          userId  movieId  rating
25000088  162541    41566     4.0
25000089  162541    45517     4.5
25000090  162541    50872     4.5
25000093  162541    58559     4.0
25000094  162541    63876     5.0

In [195]:
is_animation = movies['genres'].str.contains('Animation')

movies[is_animation][5:15]

,movieId,title,genres,isComedy,year
309,313,"Swan Princess, The (1994)",Animation|Children,False,1994
359,364,"Lion King, The (1994)",Adventure|Animation|Children|Drama|Musical|IMAX,False,1994
387,392,"Secret Adventures of Tom Thumb, The (1993)",Adventure|Animation,False,1993
545,551,"Nightmare Before Christmas, The (1993)",Animation|Children|Fantasy|Musical,False,1993
551,558,"Pagemaster, The (1994)",Action|Adventure|Animation|Children|Fantasy,False,1994
580,588,Aladdin (1992),Adventure|Animation|Children|Comedy|Musical,True,1992
586,594,Snow White and the Seven Dwarfs (1937),Animation|Children|Drama|Fantasy|Musical,False,1937
587,595,Beauty and the Beast (1991),Animation|Children|Fantasy|Musical|Romance|IMAX,False,1991
588,596,Pinocchio (1940),Animation|Children|Fantasy|Musical,False,1940
602,610,Heavy Metal (1981),Action|Adventure|Animation|Horror|Sci-Fi,False,1981

In [75]:
movies[is_animation].head(15)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
12,13,Balto (1995),Adventure|Animation|Children
47,48,Pocahontas (1995),Animation|Children|Drama|Musical|Romance
236,239,"Goofy Movie, A (1995)",Animation|Children|Comedy|Romance
241,244,Gumby: The Movie (1995),Animation|Children
309,313,"Swan Princess, The (1994)",Animation|Children
359,364,"Lion King, The (1994)",Adventure|Animation|Children|Drama|Musical|IMAX
387,392,"Secret Adventures of Tom Thumb, The (1993)",Adventure|Animation
545,551,"Nightmare Before Christmas, The (1993)",Animation|Children|Fantasy|Musical
551,558,"Pagemaster, The (1994)",Action|Adventure|Animation|Children|Fantasy
580,588,Aladdin (1992),Adventure|Animation|Children|Comedy|Musical
586,594,Snow White and the Seven Dwarfs (1937),Animation|Children|Drama|Fantasy|Musical
587,595,Beauty and the Beast (1991),Animation|Children|Fantasy|Musical|Romance|IMAX
588,596,Pinocchio (1940),Animation|Children|Fantasy|Musical
602,610,Heavy Metal (1981),Action|Adventure|Animation|Horror|Sci-Fi

<h1 style="font-size:2em;color:#2467C0">Group By and Aggregate </h1>

In [76]:
ratings_count = ratings[['movieId','rating']].groupby('rating').count()
ratings_count

        movieId
rating
0.5      393068
1.0      776815
1.5      399490
2.0     1640868
2.5     1262797
3.0     4896928
3.5     3177318
4.0     6639798
4.5     2200539
5.0     3612474

In [77]:
average_rating = ratings[['movieId','rating']].groupby('movieId').mean()
average_rating.tail()

         rating
movieId
209157      1.5
209159      3.0
209163      4.5
209169      3.0
209171      3.0

In [78]:
movie_count = ratings[['movieId','rating']].groupby('movieId').count()
movie_count.head()

         rating
movieId
1         57309
2         24228
3         11804
4          2523
5         11714

In [79]:
movie_count = ratings[['movieId','rating']].groupby('movieId').count()
movie_count.tail()

         rating
movieId
209157        1
209159        1
209163        1
209169        1
209171        1

<h1 style="font-size:2em;color:#2467C0">Merge Dataframes</h1>

In [80]:
tags.head()

   userId  movieId               tag
0       3      260           classic
1       3      260            sci-fi
2       4     1732       dark comedy
3       4     1732    great dialogue
4       4     7569  so bad it's good

In [81]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [82]:
t = tags.merge(movies, on='movieId')#.merge(user, on='userId')
t.head()

,userId,movieId,tag,title,genres
0,3,260,classic,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi
1,3,260,sci-fi,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi
2,110,260,action,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi
3,110,260,adventure,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi
4,110,260,fantasy,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi

More examples: http://pandas.pydata.org/pandas-docs/stable/merging.html

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold"><br>


Combine aggregation, merging, and filters to get useful analytics
</p>

In [83]:
avg_ratings = ratings.groupby('movieId', as_index=False).mean()
del avg_ratings['userId']
avg_ratings.head()

   movieId    rating
0        1  3.893708
1        2  3.251527
2        3  3.142028
3        4  2.853547
4        5  3.058434

In [84]:
box_office = movies.merge(avg_ratings, on='movieId', how='inner')
box_office.tail()

       movieId                           title                  genres  rating
59042   209157                       We (2018)                   Drama     1.5
59043   209159       Window of the Soul (2001)             Documentary     3.0
59044   209163                Bad Poems (2018)            Comedy|Drama     4.5
59045   209169             A Girl Thing (2001)      (no genres listed)     3.0
59046   209171  Women of Devil's Island (1962)  Action|Adventure|Drama     3.0

In [85]:
is_highly_rated = box_office['rating'] >= 4.0

box_office[is_highly_rated][-5:]

,movieId,title,genres,rating
59027,209121,Adrenalin: The BMW Touring Car Story (2014),Documentary,4.0
59028,209123,Square Roots: The Story of SpongeBob SquarePan...,Documentary,4.0
59029,209129,Destination Titan (2011),Documentary,4.5
59041,209155,Santosh Subramaniam (2008),Action|Comedy|Romance,5.0
59044,209163,Bad Poems (2018),Comedy|Drama,4.5

In [86]:
is_comedy = box_office['genres'].str.contains('Comedy')

box_office[is_comedy][:5]

,movieId,title,genres,rating
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3.893708
2,3,Grumpier Old Men (1995),Comedy|Romance,3.142028
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,2.853547
4,5,Father of the Bride Part II (1995),Comedy,3.058434
6,7,Sabrina (1995),Comedy|Romance,3.363666

In [87]:
box_office[is_comedy & is_highly_rated][-5:]

,movieId,title,genres,rating
58990,208911,Cheating in Chains (2006),Comedy,4.0000
58998,208939,Klaus (2019),Adventure|Animation|Children|Comedy,4.3125
59001,208945,Powder (2019),Comedy|Drama,4.5000
59041,209155,Santosh Subramaniam (2008),Action|Comedy|Romance,5.0000
59044,209163,Bad Poems (2018),Comedy|Drama,4.5000

<h1 style="font-size:2em;color:#2467C0">Vectorized String Operations</h1>

In [88]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

<p style="font-family: Arial; font-size:1.35em;color:#2462C0; font-style:bold"><br>

Add a new column for comedy genre flag

<br> </p>

In [89]:
movies['isComedy'] = movies['genres'].str.contains('Comedy')

In [95]:
movies[movies['isComedy']==True]

,movieId,title,genres,isComedy,year
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,True,1995
2,3,Grumpier Old Men (1995),Comedy|Romance,True,1995
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,True,1995
4,5,Father of the Bride Part II (1995),Comedy,True,1995
6,7,Sabrina (1995),Comedy|Romance,True,1995
...,...,...,...,...,...
62402,209119,Up to the World (2014),Comedy|Drama,True,2014
62411,209141,And They Lived Happily Ever After (1976),Comedy,True,1976
62416,209153,Happy Flight (2008),Comedy|Drama,True,2008
62417,209155,Santosh Subramaniam (2008),Action|Comedy|Romance,True,2008
62420,209163,Bad Poems (2018),Comedy|Drama,True,2018

<p style="font-family: Arial; font-size:1.35em;color:#2462C0; font-style:bold"><br>

More here: http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods
<br> </p>

<h1 style="font-size:2em;color:#2467C0">Parsing Timestamps</h1>

Timestamps are common in sensor data or other time series datasets.
Let us revisit the *tags.csv* dataset and read the timestamps!

In [96]:
tags = pd.read_csv('./movielens/tags.csv', sep=',')

In [97]:
tags.dtypes

userId        int64
movieId       int64
tag          object
timestamp     int64
dtype: object

<p style="font-family: Arial; font-size:1.35em;color:#2462C0; font-style:bold">

Unix time / POSIX time / epoch time records 
time in seconds <br> since midnight Coordinated Universal Time (UTC) of January 1, 1970
</p>

In [98]:
tags.head(5)

   userId  movieId               tag   timestamp
0       3      260           classic  1439472355
1       3      260            sci-fi  1439472256
2       4     1732       dark comedy  1573943598
3       4     1732    great dialogue  1573943604
4       4     7569  so bad it's good  1573943455

In [99]:
tags['parsed_time'] = pd.to_datetime(tags['timestamp'], unit='s')

<p style="font-family: Arial; font-size:1.35em;color:#2462C0; font-style:bold">

Data Type datetime64[ns] maps to either <M8[ns] or >M8[ns] depending on the hardware

</p>

In [100]:

tags['parsed_time'].dtype

dtype('<M8[ns]')

In [101]:
tags.head(2)

   userId  movieId      tag   timestamp         parsed_time
0       3      260  classic  1439472355 2015-08-13 13:25:55
1       3      260   sci-fi  1439472256 2015-08-13 13:24:16

<p style="font-family: Arial; font-size:1.35em;color:#2462C0; font-style:bold">

Selecting rows based on timestamps
</p>

In [102]:
greater_than_t = tags['parsed_time'] > '2015-02-01'

selected_rows = tags[greater_than_t]

tags.shape, selected_rows.shape

((1093360, 5), (692112, 5))

<p style="font-family: Arial; font-size:1.35em;color:#2462C0; font-style:bold">

Sorting the table using the timestamps
</p>

In [103]:
tags.sort_values(by='parsed_time', ascending=True)[:10]

        userId  movieId              tag   timestamp         parsed_time
900600  129396     2788     monty python  1135429210 2005-12-24 13:00:10
900595  129396     1732    coen brothers  1135429236 2005-12-24 13:00:36
900592  129396     1206  stanley kubrick  1135429248 2005-12-24 13:00:48
900591  129396     1193   jack nicholson  1135429371 2005-12-24 13:02:51
900607  129396     5004    peter sellers  1135429399 2005-12-24 13:03:19
900589  129396       47        brad pitt  1135429412 2005-12-24 13:03:32
900590  129396       47   morgan freeman  1135429412 2005-12-24 13:03:32
900605  129396     4011      guy ritchie  1135429431 2005-12-24 13:03:51
900604  129396     4011        brad pitt  1135429431 2005-12-24 13:03:51
900588  129396       32     bruce willis  1135429442 2005-12-24 13:04:02

<h1 style="font-size:2em;color:#2467C0">Average Movie Ratings over Time </h1>

# Are Movie Ratings related to the Year of Launch?

In [104]:
average_rating = ratings[['movieId','rating']].groupby('movieId', as_index=False).mean()
average_rating.tail()

       movieId  rating
59042   209157     1.5
59043   209159     3.0
59044   209163     4.5
59045   209169     3.0
59046   209171     3.0

In [105]:
joined = movies.merge(average_rating, on='movieId')
joined.head()
joined.corr()

           movieId  isComedy    rating
movieId   1.000000  -0.08409 -0.093459
isComedy -0.084090   1.00000 -0.024360
rating   -0.093459  -0.02436  1.000000

In [107]:
yearly_average = joined[['year','rating']].groupby('year', as_index=False).mean()
yearly_average

                     year    rating
0                    1874  3.027778
1                    1878  2.909091
2                    1880  2.666667
3                    1883  2.636364
4                    1887  1.750000
..                    ...       ...
135                  2018  3.014278
136                  2019  2.652123
137       Close Relations  4.250000
138    Das Millionenspiel  3.400000
139  Your Past Is Showing  3.083333

[140 rows x 2 columns]